Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
#include <stddef.h>                     // Defines NULL
#include <stdbool.h>                    // Defines true
#include <stdlib.h>                     // Defines EXIT_FAILURE
#include "definitions.h"                // SYS function prototypes

#include "azure/az_core.h"
#include "azure/az_iot.h"

#include "ewf_adapter.h"
#include "ewf_lib.h"
#include "ewf_platform.h"
#include "ewf_example.config.h"

#include "pic32cmls60-curiosity-buttons.h"
#include "pic32cmls60-curiosity-commands.h"
#include "pic32cmls60-curiosity-led.h"

#ifndef EWF_CONFIG_TELEMETRY_USERNAME_LENGTH
#define EWF_CONFIG_TELEMETRY_USERNAME_LENGTH        (256)
#endif

#ifndef EWF_CONFIG_TELEMETRY_CLIENT_ID_LENGTH
#define EWF_CONFIG_TELEMETRY_CLIENT_ID_LENGTH       (64)
#endif

#ifndef EWF_CONFIG_TELEMETRY_TOPIC_LENGTH
#define EWF_CONFIG_TELEMETRY_TOPIC_LENGTH           (256)
#endif

#ifndef EWF_CONFIG_TELEMETRY_LOOP_MINUTES
#define EWF_CONFIG_TELEMETRY_LOOP_MINUTES           (60)
#endif

#ifndef EWF_CONFIG_TELEMETRY_MESSAGE_LENGTH
#define EWF_CONFIG_TELEMETRY_MESSAGE_LENGTH         (1024)
#endif

#define EWF_CONFIG_MQTT_PAYLOAD_BUFFER_LENGTH        (256)
#define EWF_CONFIG_QUERY_TOPIC_BUFFER_LENGTH         (256)

extern char BUTTON_eventBuffer[EWF_CONFIG_TELEMETRY_TOPIC_LENGTH];

static char const iso_spec_time_format[] = "%Y-%m-%dT%H:%M:%SZ"; // ISO8601 Time Format

// The model this device implements
static az_span const model_id = AZ_SPAN_LITERAL_FROM_STR("dtmi:com:Microchip:PIC32CMLS60_CURIOSITY;1");
static az_span custom_registration_payload_property
= AZ_SPAN_LITERAL_FROM_STR("{\"modelId\":\"dtmi:com:Microchip:PIC32CMLS60_CURIOSITY;1\"}");

// MQTT Connection Values
static uint16_t connection_request_id = 0;
static char connection_request_id_buffer[16];

// Property Values
static az_span const property_success_name = AZ_SPAN_LITERAL_FROM_STR("success");
static az_span const property_desired_temperature_name
= AZ_SPAN_LITERAL_FROM_STR("targetTemperature");
static az_span const property_reported_maximum_temperature_name
= AZ_SPAN_LITERAL_FROM_STR("maxTempSinceLastReboot");

static az_span const property_led0_name = AZ_SPAN_LITERAL_FROM_STR("LED0");
static az_span const property_led1_name = AZ_SPAN_LITERAL_FROM_STR("LED1");
static az_span const property_disable_telemetry_name = AZ_SPAN_LITERAL_FROM_STR("disableTelemetry");
static az_span const property_telemetry_interval_name = AZ_SPAN_LITERAL_FROM_STR("telemetryInterval");

// Telemetry Values
static az_span const telemetry_temperature_name = AZ_SPAN_LITERAL_FROM_STR("temperature");
static az_span const telemetry_potentiometer_name = AZ_SPAN_LITERAL_FROM_STR("potentiometer");

// Command Values
static az_span const command_getMaxMinReport_name = AZ_SPAN_LITERAL_FROM_STR("getMaxMinReport");
static az_span const command_max_temp_name = AZ_SPAN_LITERAL_FROM_STR("maxTemp");
static az_span const command_min_temp_name = AZ_SPAN_LITERAL_FROM_STR("minTemp");
static az_span const command_avg_temp_name = AZ_SPAN_LITERAL_FROM_STR("avgTemp");
static az_span const command_start_time_name = AZ_SPAN_LITERAL_FROM_STR("startTime");
static az_span const command_end_time_name = AZ_SPAN_LITERAL_FROM_STR("endTime");
static az_span const command_empty_response_payload = AZ_SPAN_LITERAL_FROM_STR("{}");
static char command_start_time_value_buffer[32];
static char command_end_time_value_buffer[32];
static char command_response_payload_buffer[256];

static const az_span command_name_reboot_span = AZ_SPAN_LITERAL_FROM_STR("reboot");
static const az_span command_name_send_message_span = AZ_SPAN_LITERAL_FROM_STR("sendMsg");

#define DEFAULT_START_TEMP_COUNT 1
#define DEFAULT_START_TEMP_CELSIUS 22.0
#define DOUBLE_DECIMAL_PLACE_DIGITS 2

// Device Values
static double device_current_temperature = DEFAULT_START_TEMP_CELSIUS;
static double device_maximum_temperature = DEFAULT_START_TEMP_CELSIUS;
static double device_minimum_temperature = DEFAULT_START_TEMP_CELSIUS;
static double device_temperature_summation = DEFAULT_START_TEMP_CELSIUS;
static uint32_t device_temperature_count = DEFAULT_START_TEMP_COUNT;
static double device_average_temperature = DEFAULT_START_TEMP_CELSIUS;

static uint16_t device_current_potentiometer = 0;

/* Work buffers */
static char mqtt_client_username_buffer[256];
static char mqtt_client_id_buffer[128] = { 0 };
static char telemetry_topic_buffer[EWF_CONFIG_TELEMETRY_TOPIC_LENGTH];
static char register_topic_buffer[128] = { 0 };

/* The IoT Provisioning client */
static az_iot_provisioning_client provisioning_client;
/* The IoT Hub client */
static az_iot_hub_client hub_client;
static char azure_iot_hub_endpoint_buffer[128] = { 0 };
static char azure_iot_hub_device_id_buffer[128] = { 0 };
static az_span device_azure_iot_hub_endpoint;
static az_span device_id;

typedef struct _ewf_mqtt_receive_message {
    char ewf_mqtt_recv_topic[EWF_CONFIG_TELEMETRY_TOPIC_LENGTH];
    int ewf_mqtt_recv_topic_length;
    char ewf_mqtt_recv_message_buffer[EWF_CONFIG_TELEMETRY_MESSAGE_LENGTH];
    int ewf_mqtt_recv_message_length;
} ewf_mqtt_receive_message;

static ewf_mqtt_receive_message ewf_mqtt_recv_message = { 0 };

volatile uint8_t ewf_mqtt_rx_flag = 0;

static bool disableTelemetry = AZ_JSON_TOKEN_FALSE;
static uint32_t telemetryInterval = EWF_CONFIG_TELEMETRY_INTERVAL_SECONDS;

/* Prototypes */
static void azure_iot_hub_topics_subscribe(ewf_adapter* adapter_ptr);
static void button_message_send(ewf_adapter* adapter_ptr);
static void azure_iot_telemetry_message_send(ewf_adapter* adapter_ptr);
static void azure_iot_hub_properties_request(ewf_adapter* adapter_ptr);
static void azure_iot_hub_reported_property_send(ewf_adapter* adapter_ptr,
    az_span name,
    double value,
    int32_t version,
    bool write_payload_with_status);
static az_span properties_get_request_id(void);
static void azure_iot_handle_command_request(ewf_adapter* adapter_ptr,
    ewf_mqtt_receive_message* recv_message_ptr,
    az_iot_hub_client_command_request const* command_request);
static void azure_iot_receive_message_process(ewf_adapter* adapter_ptr, ewf_mqtt_receive_message* recv_message_ptr);
static void azure_iot_handle_device_property_message(ewf_adapter* adapter_ptr,
    ewf_mqtt_receive_message* recv_message_ptr,
    az_iot_hub_client_properties_message const* property_message);
static bool invoke_getMaxMinReport(ewf_adapter* adapter_ptr, az_span payload, az_span response, az_span* out_response);
static void azure_iot_process_device_property_message(ewf_adapter* adapter_ptr,
    az_span message_span,
    az_iot_hub_client_properties_message_type message_type);
static void azure_iot_send_command_response(ewf_adapter* adapter_ptr,
    az_iot_hub_client_command_request const* command_request,
    az_iot_status status,
    az_span response);
static void payload_build(uint8_t property_count, az_span const names[],
    double const values[], az_span const times[],
    az_span property_payload, az_span* out_property_payload);
static void payload_with_status_build(
    az_span name,
    double value,
    int32_t status_code_value,
    int32_t version_value,
    az_span description_value,
    az_span property_payload,
    az_span* out_property_payload);
static void update_device_temperature_property(double temperature, bool* out_is_max_temp_changed);
ewf_result ewf_mqtt_receive_message_user_callback(ewf_adapter* adapter_ptr, const char* topic_cstr, const char* payload_cstr);
ewf_result ewf_example_azure_iot_pnp_provisioning(ewf_adapter* adapter_ptr);
static void ewf_azure_iot_pnp_sample_demo(ewf_adapter* adapter_ptr);

ewf_result ewf_mqtt_receive_message_user_callback(ewf_adapter* adapter_ptr, const char* topic_cstr, const char* payload_cstr) {
    EWF_ADAPTER_VALIDATE_POINTER(adapter_ptr);

    ewf_interface* interface_ptr = adapter_ptr->interface_ptr;
    EWF_INTERFACE_VALIDATE_POINTER(interface_ptr);

    ewf_mqtt_rx_flag++;

    ewf_mqtt_recv_message.ewf_mqtt_recv_topic_length = ewfl_str_length(topic_cstr);
    ewfl_str_n_cpy(ewf_mqtt_recv_message.ewf_mqtt_recv_topic, topic_cstr, ewf_mqtt_recv_message.ewf_mqtt_recv_topic_length);

    ewf_mqtt_recv_message.ewf_mqtt_recv_message_length = ewfl_str_length(payload_cstr);
    ewfl_str_n_cpy(ewf_mqtt_recv_message.ewf_mqtt_recv_message_buffer, payload_cstr, ewf_mqtt_recv_message.ewf_mqtt_recv_message_length);

    EWF_LOG("[MQTT-Basic][Message callback:][%s][%s]\r\n", topic_cstr, payload_cstr);

