Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
    return EWF_RESULT_OK;
}

/**
 * @brief The IoT PnP provisioning example
 */
ewf_result ewf_example_azure_iot_pnp_provisioning(ewf_adapter* adapter_ptr) {
    az_result result;
    ewf_result ewf_status;

    /* Initialize the hub client with the default connection options. */
    result = az_iot_provisioning_client_init(&provisioning_client,
        AZ_SPAN_FROM_STR(EWF_CONFIG_ENDPOINT),
        AZ_SPAN_FROM_STR(EWF_CONFIG_ID_SCOPE),
        AZ_SPAN_FROM_STR(EWF_CONFIG_REGISTRATION_ID),
        NULL);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to initialize provisioning  client: az_result %ld.\n", result);
        return EWF_RESULT_IRRECOVERABLE_ERROR;
    }

    /* Get the MQTT client ID used for the MQTT connection. */
    result = az_iot_provisioning_client_get_client_id(
        &provisioning_client, mqtt_client_id_buffer, sizeof(mqtt_client_id_buffer), NULL);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to get MQTT client ID: az_result %ld.\n", result);
        return EWF_RESULT_IRRECOVERABLE_ERROR;
    }

    EWF_LOG("IoT provisioning client ID: %s\n", mqtt_client_id_buffer);

    /* Get the MQTT client username. */
    result = az_iot_provisioning_client_get_user_name(
        &provisioning_client, mqtt_client_username_buffer, sizeof(mqtt_client_username_buffer), NULL);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to get MQTT client username: az_result %ld.\n", result);
        return EWF_RESULT_IRRECOVERABLE_ERROR;
    }

    EWF_LOG("MQTT user name: %s\n", mqtt_client_username_buffer);

    /* Configure callback for MQTT message reception */
    ewf_status = ewf_adapter_mqtt_basic_message_callback_set(adapter_ptr, ewf_mqtt_receive_message_user_callback);
    if (ewf_result_failed(ewf_status)) {
        EWF_LOG("Failed to set MQTT callback: ewf_status %d.", ewf_status);
        return ewf_status;
    }

    /* Connect to the MQTT server */
    ewf_status = ewf_adapter_mqtt_basic_connect(
        adapter_ptr,
        EWF_CONFIG_ENDPOINT,
        8883,
        mqtt_client_id_buffer,
        mqtt_client_username_buffer,
        NULL); // This sample uses x509 authentication.
    if (ewf_result_failed(ewf_status)) {
        EWF_LOG("Failed to MQTT connect: ewf_status %d.", ewf_status);
        return ewf_status;
    }

    EWF_LOG("[INFO] Connected!\n");

    /* Messages received on register topic will be registration responses from the server. */
    ewf_status = ewf_adapter_mqtt_basic_subscribe(adapter_ptr, AZ_IOT_PROVISIONING_CLIENT_REGISTER_SUBSCRIBE_TOPIC);
    if (ewf_result_failed(ewf_status)) {
        EWF_LOG("Failed to subscribe to a Register topic: ewf_status %d.\n", ewf_status);
        return ewf_status;
    }

    /* Get the Register topic to publish the register request. */
    result = az_iot_provisioning_client_register_get_publish_topic(
        &provisioning_client, register_topic_buffer, sizeof(register_topic_buffer), NULL);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to get the Register topic: ewf_result %ld.\n", result);
        return result;
    }

    /* Devices registering a ModelId while using Device Provisioning Service must specify
       their ModelId in an MQTT payload sent during registration. */
    uint8_t mqtt_payload_buffer[EWF_CONFIG_MQTT_PAYLOAD_BUFFER_LENGTH] = { 0 };
    size_t mqtt_payload_buffer_length;
    result = az_iot_provisioning_client_get_request_payload(&provisioning_client,
        custom_registration_payload_property,
        NULL,
        mqtt_payload_buffer,
        sizeof(mqtt_payload_buffer),
        &mqtt_payload_buffer_length);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to initialize provisioning client: ewf_result %ld.\n", result);
        return result;
    }

    ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, (char*)register_topic_buffer, (char*)mqtt_payload_buffer);
    if (ewf_result_failed(ewf_status)) {
        EWF_LOG("Failed to publish Register request: ewf_status %d.\n", ewf_status);
        return ewf_status;
    }

    az_iot_provisioning_client_register_response register_response;
    register_response.operation_status = AZ_IOT_PROVISIONING_STATUS_UNASSIGNED;
    bool is_operation_complete = false;

    char query_topic_buffer[EWF_CONFIG_QUERY_TOPIC_BUFFER_LENGTH];

    EWF_LOG("Waiting for registration status message.\r\n");

    ewf_platform_sleep(EWF_PLATFORM_TICKS_PER_SECOND * 4 /*register_response.retry_after_seconds */);

    // Continue to parse incoming responses from the provisioning service until the device has been
    // successfully provisioned or an error occurs.   
    do
    {
        if (ewf_mqtt_rx_flag)
        {

            ewf_mqtt_rx_flag--;
            az_span const topic_span = az_span_create((uint8_t*)ewf_mqtt_recv_message.ewf_mqtt_recv_topic, ewf_mqtt_recv_message.ewf_mqtt_recv_topic_length);
            az_span const message_span = az_span_create((uint8_t*)ewf_mqtt_recv_message.ewf_mqtt_recv_message_buffer, ewf_mqtt_recv_message.ewf_mqtt_recv_message_length);

            result = az_iot_provisioning_client_parse_received_topic_and_payload(&provisioning_client, topic_span, message_span, &register_response);
            if (az_result_failed(result)) {
                EWF_LOG("Unknown Topic: %s\r\n", ewf_mqtt_recv_message.ewf_mqtt_recv_topic);
                EWF_LOG("Message from unknown topic: az_result return code 0x%08x.\r\n", result);
            }
            is_operation_complete = az_iot_provisioning_client_operation_complete(register_response.operation_status);
            if ((!is_operation_complete) || (register_response.operation_status != AZ_IOT_PROVISIONING_STATUS_ASSIGNED))
            {
                result = az_iot_provisioning_client_query_status_get_publish_topic(
                    &provisioning_client, register_response.operation_id, query_topic_buffer, sizeof(query_topic_buffer), NULL);

                if (az_result_failed(result))
                {
                    EWF_LOG("Unable to get query status publish topic: az_result return code 0x%08x.\r\n", result);
                }
                else
                {
                    /*  Wait the recommended retry-after number of seconds before query. */
                    ewf_platform_sleep(EWF_PLATFORM_TICKS_PER_SECOND * register_response.retry_after_seconds);
                    ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, (char*)query_topic_buffer, (char*)" ");
                    if (ewf_result_failed(ewf_status))
                    {
                        EWF_LOG("Failed to publish registration query message: ewf_status %d.\r\n", ewf_status);
                        return ewf_status;
                    }
                }
            }
            else
            {
                if (register_response.operation_status == AZ_IOT_PROVISIONING_STATUS_ASSIGNED)
                {
                    break;
                }
                else
                {
                    EWF_LOG("Registration failed with dPS response: operation status %d.\r\n", register_response.operation_status);
                    EWF_LOG("Operation ID: %s\r\n", register_response.operation_id._internal.ptr);
                    EWF_LOG("Registration error track id: %s\r\n", register_response.registration_state.error_tracking_id._internal.ptr);
                    EWF_LOG("Retrying Registration.\r\n");
                }

