Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
            }
        }
        else
        {
            /* Send a blank payload after register request if there is not message from host endpoint */
            ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, (char*)register_topic_buffer, (char*)" ");
            if (ewf_result_failed(ewf_status)) {
                EWF_LOG("Failed to publish Register request: ewf_status %d.\n", ewf_status);
                return ewf_status;
            }
        }
    } while (!is_operation_complete);

    /* At this point  operation_status is AZ_IOT_PROVISIONING_STATUS_ASSIGNED */
    EWF_LOG("Device provisioned!!!\r\n");
    device_azure_iot_hub_endpoint
        = az_span_create((uint8_t*)azure_iot_hub_endpoint_buffer, sizeof(azure_iot_hub_endpoint_buffer));
    device_id
        = az_span_create((uint8_t*)azure_iot_hub_device_id_buffer, sizeof(azure_iot_hub_device_id_buffer));

    az_span_copy(device_azure_iot_hub_endpoint, register_response.registration_state.assigned_hub_hostname);
    device_azure_iot_hub_endpoint = az_span_slice(device_azure_iot_hub_endpoint, 0,
        az_span_size(register_response.registration_state.assigned_hub_hostname));

    az_span_copy(device_id, register_response.registration_state.device_id);
    device_id = az_span_slice(device_id, 0,
        az_span_size(register_response.registration_state.device_id));

    EWF_LOG("IoT Hub Hostname: %s\r\nDevice Id: %s\r\n",
        (char*)device_azure_iot_hub_endpoint._internal.ptr,
        (char*)device_id._internal.ptr);

    // Disconnect from the MQTT client from Provisioning service
    ewf_status = ewf_adapter_mqtt_basic_disconnect(adapter_ptr);
    if (ewf_result_failed(ewf_status)) {
        EWF_LOG("Failed to disconnect MQTT client: ewf_result return code 0x%08lx.\r\n", ewf_status);
    }

    EWF_LOG("Client disconnected from provisioning service.\r\n");

    // The Plug and Play model ID is specified as an option during initial client initialization.
    az_iot_hub_client_options options = az_iot_hub_client_options_default();
    options.model_id = model_id;

    /* Initialize the hub client with the default connection options. */
    result = az_iot_hub_client_init(&hub_client, device_azure_iot_hub_endpoint, device_id, &options);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to initialize hub client: az_result %ld.\r\n", result);
        return EWF_RESULT_IRRECOVERABLE_ERROR;
    }

    memset(mqtt_client_id_buffer, 0, 128);

    result = az_iot_hub_client_get_client_id(&hub_client,
        mqtt_client_id_buffer, sizeof(mqtt_client_id_buffer), NULL);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to get MQTT client id: az_result %ld.\r\n", result);
        return EWF_RESULT_IRRECOVERABLE_ERROR;
    }

    memset(mqtt_client_username_buffer, 0, 128);

    /* Get the MQTT client username. */
    result = az_iot_hub_client_get_user_name(&hub_client,
        mqtt_client_username_buffer, sizeof(mqtt_client_username_buffer), NULL);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to get MQTT client username: az_result %ld.\n", result);
        return EWF_RESULT_IRRECOVERABLE_ERROR;
    }

    /* Connect to the MQTT server */
    ewf_status = ewf_adapter_mqtt_basic_connect(
        adapter_ptr,
        (char*)device_azure_iot_hub_endpoint._internal.ptr,
        8883,
        mqtt_client_id_buffer,
        mqtt_client_username_buffer,
        NULL);
    if (ewf_result_failed(ewf_status)) {
        EWF_LOG("Failed to MQTT connect: ewf_status %d.", ewf_status);
        return ewf_status;
    }

    EWF_LOG("[INFO] Connected!\n");

    /* Subscribe the incoming commands to the device and notify about device properties. */
    azure_iot_hub_topics_subscribe(adapter_ptr);

    /* Send reported properties */
    azure_iot_hub_reported_property_send(adapter_ptr, property_reported_maximum_temperature_name, device_current_temperature, 0, false);

    /* Request all property information */
    azure_iot_hub_properties_request(adapter_ptr);

    /* Send telemetry and process received commands or device property messages */
    ewf_azure_iot_pnp_sample_demo(adapter_ptr);

    // Disconnect from the IoT Hub
    ewf_status = ewf_adapter_mqtt_basic_disconnect(adapter_ptr);
    if (ewf_result_failed(ewf_status)) {
        EWF_LOG("Failed to disconnect MQTT client: ewf_result return code 0x%08lx.\r\n", ewf_status);
    }

    return EWF_RESULT_OK;
}

static void ewf_azure_iot_pnp_sample_demo(ewf_adapter* adapter_ptr)
{

    int minutes_counter;
    int seconds_counter;
    int telemetry_counter = 1;
    
    EIC_CallbackRegister(EIC_PIN_12, (EIC_CALLBACK)BUTTON_SW0_callback, 0);
    EIC_InterruptEnable(EIC_PIN_12);
    EIC_CallbackRegister(EIC_PIN_4, (EIC_CALLBACK)BUTTON_SW1_callback, 0);
    EIC_InterruptEnable(EIC_PIN_4);       
    ADC_Enable();
    LED_init();

    for (minutes_counter = 0;
        (EWF_CONFIG_TELEMETRY_LOOP_MINUTES == 0) || (EWF_CONFIG_TELEMETRY_LOOP_MINUTES != 0 && minutes_counter < EWF_CONFIG_TELEMETRY_LOOP_MINUTES);
        minutes_counter++)
    {
        for (seconds_counter = 0; seconds_counter < 60; seconds_counter++)
        {
            if (ewf_mqtt_rx_flag)
            {
                ewf_mqtt_rx_flag--;
                EWF_LOG("Waiting for command request or device property message.\r\n");

                azure_iot_receive_message_process(adapter_ptr, &ewf_mqtt_recv_message);

            }
            if (telemetry_counter++ >= telemetryInterval)
            {
                //if (disableTelemetry == AZ_JSON_TOKEN_FALSE)
                {
                    azure_iot_telemetry_message_send(adapter_ptr);
                }
                telemetry_counter = 1;
            }
            if (BUTTON_SW0_check() == BUTTON_PRESS_TRUE)
            {
                button_message_send(adapter_ptr);                
            }
            if (BUTTON_SW1_check() == BUTTON_PRESS_TRUE)
            {
                button_message_send(adapter_ptr);                
            }
            LED_refresh();
            if (SYS_rebootTimer > 0)
            {
                SYS_rebootTimer--;
                if (SYS_rebootTimer == 0)
                {
                    __NVIC_SystemReset();
                }
            }
            /* Sleep for the desired telemetry interval */
            ewf_platform_sleep(EWF_PLATFORM_TICKS_PER_SECOND * 1);
        }
    }

