Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
}

/* Process the message received */
static void azure_iot_receive_message_process(ewf_adapter* adapter_ptr, ewf_mqtt_receive_message* recv_message_ptr)
{

    az_result result = AZ_OK;

    az_span const topic_span = az_span_create((uint8_t*)recv_message_ptr->ewf_mqtt_recv_topic, recv_message_ptr->ewf_mqtt_recv_topic_length);
    az_span const message_span = az_span_create((uint8_t*)recv_message_ptr->ewf_mqtt_recv_message_buffer, recv_message_ptr->ewf_mqtt_recv_message_length);

    az_iot_hub_client_properties_message property_message;
    az_iot_hub_client_command_request command_request;

    result = az_iot_hub_client_properties_parse_received_topic(
        &hub_client, topic_span, &property_message);
    if (az_result_succeeded(result))
    {
        EWF_LOG("Client received a valid topic.\r\n");
        EWF_LOG("Topic: %s\r\n", recv_message_ptr->ewf_mqtt_recv_topic);
        EWF_LOG("Payload: %s\r\n", recv_message_ptr->ewf_mqtt_recv_message_buffer);
        EWF_LOG("Status: %d\r\n", property_message.status);

        azure_iot_handle_device_property_message(adapter_ptr, recv_message_ptr, &property_message);
    }
    else
    {
        result = az_iot_hub_client_commands_parse_received_topic(&hub_client, topic_span, &command_request);
        if (az_result_succeeded(result))
        {
            EWF_LOG("Client received a valid topic.\r\n");
            EWF_LOG("Topic: %s\r\n", recv_message_ptr->ewf_mqtt_recv_topic);
            EWF_LOG("Payload: %s\r\n", recv_message_ptr->ewf_mqtt_recv_message_buffer);

            azure_iot_handle_command_request(adapter_ptr, recv_message_ptr, &command_request);
        }

    }

}

// Handles an incoming command from Azure IoT Hub
static void azure_iot_handle_command_request(ewf_adapter* adapter_ptr,
    ewf_mqtt_receive_message* recv_message_ptr,
    az_iot_hub_client_command_request const* command_request)
{
    az_span const message_span = az_span_create((uint8_t*)recv_message_ptr->ewf_mqtt_recv_message_buffer, recv_message_ptr->ewf_mqtt_recv_message_length);

    // Check for 'getMaxMinReport' command
    if ((az_span_is_content_equal(command_request->component_name, AZ_SPAN_EMPTY))
        && (az_span_is_content_equal(command_getMaxMinReport_name, command_request->command_name)))
    {
        az_iot_status status;
        az_span command_response_payload = AZ_SPAN_FROM_BUFFER(command_response_payload_buffer);

        // Process the command
        if (!invoke_getMaxMinReport(adapter_ptr, message_span, command_response_payload, &command_response_payload))
        {
            status = AZ_IOT_STATUS_BAD_REQUEST;
        }
        else
        {
            status = AZ_IOT_STATUS_OK;
        }
        EWF_LOG("Client processed command 'getMaxMinReport'\r\n");

        azure_iot_send_command_response(adapter_ptr, command_request, status, command_response_payload);
    }
    // Check for 'reboot' command
    else if ((az_span_is_content_equal(command_request->component_name, AZ_SPAN_EMPTY))
        && (az_span_is_content_equal(command_name_reboot_span, command_request->command_name)))
    {
        az_iot_status status;
        az_span command_response_payload = AZ_SPAN_FROM_BUFFER(command_response_payload_buffer);

        // Process the command
        if (!COMMAND_Handler_reboot(message_span, command_response_payload, &command_response_payload))
        {
            status = AZ_IOT_STATUS_BAD_REQUEST;
        }
        else
        {
            status = AZ_IOT_STATUS_OK;
        }
        EWF_LOG("Client processed command 'reboot'\r\n");

        azure_iot_send_command_response(adapter_ptr, command_request, status, command_response_payload);
    }
    // Check for 'sendMsg' command
    else if ((az_span_is_content_equal(command_request->component_name, AZ_SPAN_EMPTY))
        && (az_span_is_content_equal(command_name_send_message_span, command_request->command_name)))
    {
        az_iot_status status;
        az_span command_response_payload = AZ_SPAN_FROM_BUFFER(command_response_payload_buffer);

        // Process the command
        if (!COMMAND_Handler_sendMsg(message_span, command_response_payload, &command_response_payload))
        {
            status = AZ_IOT_STATUS_BAD_REQUEST;
        }
        else
        {
            status = AZ_IOT_STATUS_OK;
        }
        EWF_LOG("Client processed command 'sendMsg'\r\n");

        azure_iot_send_command_response(adapter_ptr, command_request, status, command_response_payload);
    }
    else
    {
        EWF_LOG("Command not supported: %s\r\n", command_request->command_name._internal.ptr);
        azure_iot_send_command_response(adapter_ptr, command_request, AZ_IOT_STATUS_NOT_FOUND, command_empty_response_payload);
    }
}

// Sends a response to a command invoked by Azure IoT Hub
static void azure_iot_send_command_response(ewf_adapter* adapter_ptr,
    az_iot_hub_client_command_request const* command_request,
    az_iot_status status,
    az_span response)
{
    az_result result;
    ewf_result ewf_status;

    // Get the command response topic to publish the command response.
    char command_response_topic_buffer[128] = { 0 };
    result = az_iot_hub_client_commands_response_get_publish_topic(
        &hub_client,
        command_request->request_id,
        (uint16_t)status,
        command_response_topic_buffer,
        sizeof(command_response_topic_buffer),
        NULL);
    if (az_result_failed(result)) {
        EWF_LOG("Failed to get the command response topic: az_result %d.", result);
        exit(1);
    }

    // Publish the command response.
    ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, command_response_topic_buffer, (char*)response._internal.ptr);
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG("Failed to publish telemetry: ewf_result %d.\n", ewf_status);
    }
    EWF_LOG("Client published the Command response.\r\n");
    EWF_LOG("Status: %d\r\n", status);
    EWF_LOG("Payload: %s\r\n", response._internal.ptr);
}

// Called when the command "getMaxMinReport" arrives from the service.
// It writes the response payload based on simulated temperature data.
static bool invoke_getMaxMinReport(ewf_adapter* adapter_ptr, az_span payload, az_span response, az_span* out_response)
{
    int32_t incoming_since_value_len = 0;
    az_json_reader jr;

    az_result result = AZ_OK;
    ewf_result ewf_status;

    result = az_json_reader_init(&jr, payload, NULL);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Failed to parse for `since` field in payload, Could not initialize JSON reader: az_result %d\r\n", result);
        exit(1);
    }

    result = az_json_reader_next_token(&jr);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Failed to parse for `since` field in payload, Could not move to next property value: az_result %d\r\n", result);
        exit(1);
    }

    if (az_result_failed(az_json_token_get_string(
        &jr.token,
        command_start_time_value_buffer,
        sizeof(command_start_time_value_buffer),
        &incoming_since_value_len)))
    {
        *out_response = command_empty_response_payload;
        return false;
    }

    // Set the response payload to error if the `since` value was empty.
    if (incoming_since_value_len == 0)
    {
        *out_response = command_empty_response_payload;
        return false;
    }

    az_span start_time_span
        = az_span_create((uint8_t*)command_start_time_value_buffer, incoming_since_value_len);
    EWF_LOG("Start time: %s\r\n", start_time_span._internal.ptr);

    // Get the current time as a string
    time_t rawtime;
    struct tm* timeinfo;
    time(&rawtime);
    timeinfo = (struct tm *)localtime(&rawtime);
    size_t length = strftime(
        command_end_time_value_buffer,
        sizeof(command_end_time_value_buffer),
        iso_spec_time_format,
        timeinfo);
    az_span end_time_span = az_span_create((uint8_t*)command_end_time_value_buffer, (int32_t)length);
    EWF_LOG("End time: %s\r\n", end_time_span._internal.ptr);

    // Write command response message
    uint8_t count = 3;
    az_span const names[3] = { command_max_temp_name, command_min_temp_name, command_avg_temp_name };
    double const values[3]
        = { device_maximum_temperature, device_minimum_temperature, device_average_temperature };
    az_span const times[2] = { start_time_span, end_time_span };

    payload_build(count, names, values, times, response, out_response);

