Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
    return true;
}

// Handles incoming properties from Azure IoT Hub
static void azure_iot_handle_device_property_message(ewf_adapter* adapter_ptr,
    ewf_mqtt_receive_message* recv_message_ptr,
    az_iot_hub_client_properties_message const* property_message)
{
    az_span const message_span = az_span_create((uint8_t*)recv_message_ptr->ewf_mqtt_recv_message_buffer, recv_message_ptr->ewf_mqtt_recv_message_length);

    // Invoke appropriate action per message type (3 types only).
    switch (property_message->message_type)
    {
        // A message from a property GET publish message with the property document as a payload.
    case AZ_IOT_HUB_CLIENT_PROPERTIES_MESSAGE_TYPE_GET_RESPONSE:
        EWF_LOG("Message Type: GET\r\n");
        azure_iot_process_device_property_message(adapter_ptr, message_span, property_message->message_type);
        break;

        // An update to the desired properties with the properties as a payload.
    case AZ_IOT_HUB_CLIENT_PROPERTIES_MESSAGE_TYPE_WRITABLE_UPDATED:
        EWF_LOG("Message Type: Desired Properties\r\n");
        azure_iot_process_device_property_message(adapter_ptr, message_span, property_message->message_type);
        break;

        // When the device publishes a property update, this message type arrives when
        // server acknowledges this.
    case AZ_IOT_HUB_CLIENT_PROPERTIES_MESSAGE_TYPE_ACKNOWLEDGEMENT:
        EWF_LOG("Message Type: IoT Hub has acknowledged properties that the device sent\r\n");
        break;

        // An error has occurred
    case AZ_IOT_HUB_CLIENT_PROPERTIES_MESSAGE_TYPE_ERROR:
        EWF_LOG("Message Type: Request Error\r\n");
        break;
    }
}


// Handles incoming properties from Azure IoT Hub
static void azure_iot_process_device_property_message(ewf_adapter* adapter_ptr,
    az_span message_span,
    az_iot_hub_client_properties_message_type message_type)
{
    az_json_reader jr;
    az_result result = az_json_reader_init(&jr, message_span, NULL);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Could not initialize JSON reader: az_result %d\r\n", result);
        exit(1);
    }

    int32_t version_number;
    result = az_iot_hub_client_properties_get_properties_version(
        &hub_client, &jr, message_type, &version_number);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Could not get property version: az_result %d\r\n", result);
        exit(1);
    }

    result = az_json_reader_init(&jr, message_span, NULL);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Could not initialize JSON reader: az_result %d\r\n", result);
        exit(1);
    }

    double desired_temperature;
    uint32_t desired_led0_status;
    uint32_t desired_led1_status;
    bool desired_disable_telemetry;
    uint32_t desired_telemetry_interval;
    az_span component_name;

    // Applications call az_iot_hub_client_properties_get_next_component_property to enumerate
    // properties received.
    while (az_result_succeeded(az_iot_hub_client_properties_get_next_component_property(
        &hub_client, &jr, message_type, AZ_IOT_HUB_CLIENT_PROPERTY_WRITABLE, &component_name)))
    {
        if (az_json_token_is_text_equal(&jr.token, property_desired_temperature_name))
        {
            // Process an update for desired temperature.
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not move to property value: az_result % d\r\n", result);
            }

            result = az_json_token_get_double(&jr.token, &desired_temperature);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not get property value: az_result % d\r\n", result);
            }

            bool is_max_temp_changed;

            // Update device temperature locally and report update to server.
            update_device_temperature_property(desired_temperature, &is_max_temp_changed);
            azure_iot_hub_reported_property_send(adapter_ptr,
                property_desired_temperature_name, desired_temperature, version_number, true);

            if (is_max_temp_changed)
            {
                azure_iot_hub_reported_property_send(adapter_ptr,
                    property_reported_maximum_temperature_name, device_maximum_temperature, 0, false);
            }

            // Skip to next property value
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not move to next property name: az_result % d\r\n", result);
            }
        }
        else if (az_json_token_is_text_equal(&jr.token, property_led0_name))
        {
            // Process an update for desired LED0 state.
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not move to property value: az_result % d\r\n", result);
            }

            result = az_json_token_get_uint32(&jr.token, &desired_led0_status);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not get property value: az_result % d\r\n", result);
            }

            // Update LED0 locally and report update to server.
            LED_controller[LED0_GREEN].mode = desired_led0_status;
            azure_iot_hub_reported_property_send(adapter_ptr,
                property_led0_name, desired_led0_status, version_number, true);

            // Skip to next property value
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not move to next property name: az_result % d\r\n", result);
            }
        }
        else if (az_json_token_is_text_equal(&jr.token, property_led1_name))
        {
            // Process an update for desired LED1 state.
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not move to property value: az_result % d\r\n", result);
            }

            result = az_json_token_get_uint32(&jr.token, &desired_led1_status);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not get property value: az_result % d\r\n", result);
            }

            // Update LED1 locally and report update to server.
            LED_controller[LED1_RED].mode = desired_led1_status;
            azure_iot_hub_reported_property_send(adapter_ptr,
                property_led1_name, desired_led1_status, version_number, true);

