Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
            // Skip to next property value
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not move to next property name: az_result % d\r\n", result);
            }
        }
        else if (az_json_token_is_text_equal(&jr.token, property_disable_telemetry_name))
        {
            // Process an update for desired disableTelemetry.
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not move to property value: az_result % d\r\n", result);
            }

            result = az_json_token_get_boolean(&jr.token, &desired_disable_telemetry);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not get property value: az_result % d\r\n", result);
            }

            // Set the property internally and report update to server.
            disableTelemetry = desired_disable_telemetry;
            azure_iot_hub_reported_property_send(adapter_ptr,
                property_disable_telemetry_name, desired_disable_telemetry, version_number, true);

            // Skip to next property value
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not move to next property name: az_result % d\r\n", result);
            }
        }
        else if (az_json_token_is_text_equal(&jr.token, property_telemetry_interval_name))
        {
            // Process an update for desired telemetry interval.
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not move to property value: az_result % d\r\n", result);
            }

            result = az_json_token_get_uint32(&jr.token, &desired_telemetry_interval);
            if (az_result_failed(result))
            {
                EWF_LOG("Could not get property value: az_result % d\r\n", result);
            }

            // Set the property internally and report update to server.
            telemetryInterval = desired_telemetry_interval;
            azure_iot_hub_reported_property_send(adapter_ptr,
                property_telemetry_interval_name, desired_telemetry_interval, version_number, true);

            // Skip to next property value
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not move to next property name: az_result % d\r\n", result);
            }
        }        
        else
        {
            EWF_LOG("Unknown Property Received: %s\r\n", jr.token.slice._internal.ptr);
            // The JSON reader must be advanced regardless of whether the property
            // is of interest or not.
            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not move to next property value: az_result % d\r\n", result);
            }

            // Skip children in case the property value is an object
            result = az_json_reader_skip_children(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not skip children: az_result % d\r\n", result);
            }

            result = az_json_reader_next_token(&jr);
            if (az_result_failed(result))
            {
                EWF_LOG("Invalid JSON. Could not move to next property name: az_result % d\r\n", result);
            }
        }
    }
}
/* Send a request to Azure IoT Hub to request all properties from the device */
static void azure_iot_hub_properties_request(ewf_adapter* adapter_ptr)
{
    az_result result = AZ_OK;
    ewf_result ewf_status = EWF_RESULT_OK;

    // Get the topic to publish the property document request.
    char property_document_topic_buffer[128] = { 0 };
    result = az_iot_hub_client_properties_document_get_publish_topic(
        &hub_client,
        properties_get_request_id(),
        property_document_topic_buffer,
        sizeof(property_document_topic_buffer),
        NULL);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("IoTHub client device twin get topic fail: az_result %ld.\n", result);
    }

    ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, property_document_topic_buffer,
        (char*)" ");
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG("Failed to publish telemetry: ewf_status %d.\n", ewf_status);
    }

}

/* Creates a message with payload reporting device status and then sends to Azure IoT Hub */
static void azure_iot_hub_reported_property_send(ewf_adapter* adapter_ptr,
    az_span name,
    double value,
    int32_t version,
    bool write_payload_with_status)
{
    az_result result = AZ_OK;
    ewf_result ewf_status = EWF_RESULT_OK;

    // Get the property topic to send a reported property update.
    char property_update_topic_buffer[128] = { 0 };
    result = az_iot_hub_client_properties_get_reported_publish_topic(
        &hub_client,
        properties_get_request_id(),
        property_update_topic_buffer,
        sizeof(property_update_topic_buffer),
        NULL);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Failed to get the property update topic: az_result %ld.\n", result);
        exit(1);
    }

    // Write the updated reported property message.
    char reported_property_payload_buffer[128] = { 0 };
    az_span reported_property_payload = AZ_SPAN_FROM_BUFFER(reported_property_payload_buffer);

    if (write_payload_with_status)
    {
        payload_with_status_build(
            name,
            value,
            AZ_IOT_STATUS_OK,
            version,
            property_success_name,
            reported_property_payload,
            &reported_property_payload);
    }
    else
    {
        uint8_t count = 1;
        az_span const names[1] = { name };
        double const values[1] = { value };

