Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
        payload_build(
            count, names, values, NULL, reported_property_payload, &reported_property_payload);
    }

    ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, property_update_topic_buffer, (char*)reported_property_payload._internal.ptr);
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG("Failed to publish telemetry: ewf_status %d.\n", ewf_status);
    }
}

static az_span properties_get_request_id(void)
{
    az_span remainder;
    az_span out_span = az_span_create(
        (uint8_t*)connection_request_id_buffer, sizeof(connection_request_id_buffer));

    connection_request_id++;
    if (connection_request_id == UINT16_MAX)
    {
        // Connection id has looped.  Reset.
        connection_request_id = 1;
    }

    az_result result = az_span_u32toa(out_span, connection_request_id, &remainder);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Failed to get request id: az_result %ld.\n", result);
    }

    return az_span_slice(out_span, 0, az_span_size(out_span) - az_span_size(remainder));

}
/* Subscribe to MQTT topics for Azure IoT Hub */
static void azure_iot_hub_topics_subscribe(ewf_adapter* adapter_ptr)
{
    ewf_result ewf_status = EWF_RESULT_OK;

    /* Subscribe to the incoming commands */
    ewf_status = ewf_adapter_mqtt_basic_subscribe(adapter_ptr, AZ_IOT_HUB_CLIENT_COMMANDS_SUBSCRIBE_TOPIC);
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG_ERROR("Failed to subscribe to a topic: ewf_status %d.\n", ewf_status);
    }

    /* Subscribe to the incoming commands */
    ewf_status = ewf_adapter_mqtt_basic_subscribe(adapter_ptr, AZ_IOT_HUB_CLIENT_PROPERTIES_WRITABLE_UPDATES_SUBSCRIBE_TOPIC);
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG_ERROR("Failed to subscribe to a topic: ewf_status %d.\n", ewf_status);
    }

    /* Subscribe to the incoming commands */
    ewf_status = ewf_adapter_mqtt_basic_subscribe(adapter_ptr, AZ_IOT_HUB_CLIENT_PROPERTIES_MESSAGE_SUBSCRIBE_TOPIC);
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG_ERROR("Failed to subscribe to a topic: ewf_status %d.\n", ewf_status);
    }

}

/* Send button event */
static void button_message_send(ewf_adapter* adapter_ptr)
{
    ewf_result ewf_status = EWF_RESULT_OK;

    /* Get the Telemetry topic to publish the telemetry messages. */
    az_result result = az_iot_hub_client_telemetry_get_publish_topic(
        &hub_client, NULL, telemetry_topic_buffer, sizeof(telemetry_topic_buffer), NULL);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Failed to get the Telemetry topic: az_result %ld.\n", result);
        exit(1);
    }

    az_span telemetry_payload = AZ_SPAN_FROM_BUFFER(BUTTON_eventBuffer);

    ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, telemetry_topic_buffer, (char*)telemetry_payload._internal.ptr);
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG("Failed to publish telemetry: ewf_status %d.\n", ewf_status);
    }

}

/* Send telemetry message*/
static void azure_iot_telemetry_message_send(ewf_adapter* adapter_ptr)
{
    ewf_result ewf_status = EWF_RESULT_OK;

    /* Get the Telemetry topic to publish the telemetry messages. */
    az_result result = az_iot_hub_client_telemetry_get_publish_topic(
        &hub_client, NULL, telemetry_topic_buffer, sizeof(telemetry_topic_buffer), NULL);
    if (az_result_failed(result))
    {
        EWF_LOG_ERROR("Failed to get the Telemetry topic: az_result %ld.\n", result);
        exit(1);
    }

    /* Build Telemetry Message */
    uint8_t telemetry_count = 1;
    device_current_potentiometer = ADC_ConversionResultGet();
    az_span const names[1] = { telemetry_potentiometer_name };
    double const values[1] = { device_current_potentiometer };

    char telemetry_payload_buffer[128] = { 0 };
    az_span telemetry_payload = AZ_SPAN_FROM_BUFFER(telemetry_payload_buffer);
    payload_build(telemetry_count, names, values, NULL, telemetry_payload, &telemetry_payload);

    ewf_status = ewf_adapter_mqtt_basic_publish(adapter_ptr, telemetry_topic_buffer, (char*)telemetry_payload._internal.ptr);
    if (ewf_result_failed(ewf_status))
    {
        EWF_LOG("Failed to publish telemetry: ewf_status %d.\n", ewf_status);
    }

}

/* Build the JSON payload with response to a desired property  */
static void payload_with_status_build(
    az_span name,
    double value,
    int32_t status_code_value,
    int32_t version_value,
    az_span description_value,
    az_span property_payload,
    az_span* out_property_payload)
{
    az_json_writer jw;

    az_result result = (az_json_writer_init(&jw, property_payload, NULL));
    if (az_result_failed(result))
    {
        EWF_LOG("JSON writer failed to init writer: az_result %ld.\n", result);
        exit(1);
    }

    result = az_json_writer_append_begin_object(&jw);
    if (az_result_failed(result))
    {
        EWF_LOG("JSON writer append begin object fail: az_result %ld.\n", result);
        exit(1);
    }

    result = az_iot_hub_client_properties_writer_begin_response_status(
        &hub_client, &jw, name, status_code_value, version_value, description_value);
    if (az_result_failed(result))
    {
        EWF_LOG("Failed to prefix data: az_result %ld.\n", result);
        exit(1);
    }

    // result = az_json_writer_append_int32(&jw, value);
    result = az_json_writer_append_double(&jw, value, DOUBLE_DECIMAL_PLACE_DIGITS);
    if (az_result_failed(result))
    {
        EWF_LOG("JSON writer append double fail: az_result %ld.\n", result);
        exit(1);
    }

    result = az_iot_hub_client_properties_writer_end_response_status(&hub_client, &jw);
    if (az_result_failed(result))
    {
        EWF_LOG("Failed to suffix data: az_result %ld.\n", result);
        exit(1);
    }

    result = az_json_writer_append_end_object(&jw);
    if (az_result_failed(result))
    {
        EWF_LOG("JSON writer append end object failed: az_result % ld.\n", result);
        exit(1);
    }
    *out_property_payload = az_json_writer_get_bytes_used_in_destination(&jw);

