Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/azure_iot_pnp_pic32cmls60-curiosity.c
}

/* Build the telemetry JSON payload.  */
static void payload_build(uint8_t property_count, az_span const names[],
    double const values[], az_span const times[],
    az_span property_payload, az_span* out_property_payload)
{
    az_json_writer jw;

    az_result result = (az_json_writer_init(&jw, property_payload, NULL));
    if (az_result_failed(result))
    {
        EWF_LOG("Json writer failed to init writer: az_result %ld.\n", result);
        exit(1);
    }

    result = az_json_writer_append_begin_object(&jw);
    if (az_result_failed(result))
    {
        EWF_LOG("Json writer append begin object fail: az_result %ld.\n", result);
        exit(1);
    }

    for (uint8_t i = 0; i < property_count; i++)
    {
        result = az_json_writer_append_property_name(&jw, names[i]);
        if (az_result_failed(result))
        {
            EWF_LOG("Json writer append property name fail: az_result %ld.\n", result);
            exit(1);
        }

        //result = az_json_writer_append_int32(&jw, values[i]);
        result = az_json_writer_append_double(&jw, values[i], DOUBLE_DECIMAL_PLACE_DIGITS);
        if (az_result_failed(result))
        {
            EWF_LOG("Json writer append double fail: az_result %ld.\n", result);
            exit(1);
        }
    }

    if (times != NULL)
    {

        result = az_json_writer_append_property_name(&jw, command_start_time_name);
        if (az_result_failed(result))
        {
            EWF_LOG("Json writer append property name fail: az_result %ld.\n", result);
            exit(1);
        }

        result = az_json_writer_append_string(&jw, times[0]);
        if (az_result_failed(result))
        {
            EWF_LOG("Json writer append string fail: az_result %ld.\n", result);
            exit(1);
        }

        result = az_json_writer_append_property_name(&jw, command_end_time_name);
        if (az_result_failed(result))
        {
            EWF_LOG("Json writer append property name fail: az_result %ld.\n", result);
            exit(1);
        }

        result = az_json_writer_append_string(&jw, times[1]);
        if (az_result_failed(result))
        {
            EWF_LOG("Json writer append string fail: az_result %ld.\n", result);
            exit(1);
        }
    }

    result = az_json_writer_append_end_object(&jw);
    if (az_result_failed(result))
    {
        EWF_LOG("Json writer append end object fail: az_result %ld.\n", result);
        exit(1);
    }
    *out_property_payload = az_json_writer_get_bytes_used_in_destination(&jw);
}

// update_device_temperature_property updates the simulated device temperature as well
// as the temperature's statistics over time
static void update_device_temperature_property(double temperature, bool* out_is_max_temp_changed)
{
    *out_is_max_temp_changed = false;
    device_current_temperature = temperature;

    // Update maximum or minimum temperatures.
    if (device_current_temperature > device_maximum_temperature)
    {
        device_maximum_temperature = device_current_temperature;
        *out_is_max_temp_changed = true;
    }
    else if (device_current_temperature < device_minimum_temperature)
    {
        device_minimum_temperature = device_current_temperature;
    }

    // Calculate the new average temperature.
    device_temperature_count++;
    device_temperature_summation += device_current_temperature;
    device_average_temperature = device_temperature_summation / device_temperature_count;

    EWF_LOG("Client updated desired temperature variables locally.\r\n");
    EWF_LOG("Current Temperature: %2f\r\n", device_current_temperature);
    EWF_LOG("Maximum Temperature: %2f\r\n", device_maximum_temperature);
    EWF_LOG("Minimum Temperature: %2f\r\n", device_minimum_temperature);
    EWF_LOG("Average Temperature: %2f\r\n", device_average_temperature);
}
